# Параметры вещей
MIN_DEFENSE_PERCENT = 0.0
MAX_DEFENSE_PERCENT = 0.1
MIN_ATTACK_BONUS = 0
MAX_ATTACK_BONUS = 20
MIN_HEALTH_BONUS = 0
MAX_HEALTH_BONUS = 20

# Параметры персонажей
MIN_HP = 80
MAX_HP = 120
MIN_BASE_ATTACK = 20
MAX_BASE_ATTACK = 40
MIN_BASE_DEFENSE = 0.0
MAX_BASE_DEFENSE = 0.05

# Количество
NUMBER_OF_THINGS = 15
NUMBER_OF_PERSONS = 10
MIN_THINGS_PER_PERSON = 1
MAX_THINGS_PER_PERSON = 4

# Имена (20 штук)
NAMES = [
    "Уолтер Уайт", "Джесси Пинкман", "Сол Гудман", "Майк Эрмантраут",
    "Густаво Фринг", "Хэнк Шрейдер", "Мари Шрейдер", "Скайлер Уайт",
    "Уолтер-мл.", "Лидия Родарт", "Тодд Алкист", "Стивен Гомес",
    "Хуан Болса", "Гектор Саламанка", "Марко Саламанка", "Леонель Саламанка",
    "Тайрус Китт", "Виктор", "Гейл Боттичер", "Джейн Марголис"
]

# Параметры боя
MAX_ROUNDS = 1000
LOG_FILE = "battle_log.txt"

# Экипировка (10 штук)
THING_NAMES = [
    "Щит Мертвых", "Кольцо дипломата", "Доспехи из чешуи дракона",
    "Латы титана", "Амулет смерти", "Шлем-череп", "Меч правосудия",
    "Сандалии святого", "Плащ из крыльев дракона", "Гладиус титана"
]